{
  "architectures": [
    "MegaDNACausalLM"
  ],
  "depth": [
    6,
    4,
    2
  ],
  "dim": [
    768,
    512,
    256
  ],
  "dtype": "float32",
  "eos_token_id": 5,
  "max_seq_len": [
    128,
    32,
    16
  ],
  "model_type": "megadna",
  "pad_token_id": 0,
  "transformers_version": "4.57.3",
  "vocab_size": 6
}
